# MismatchConnectorDistSysToCircuit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..MismatchConnectorDistSysToCircuit Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Cannot add [Element] to Circuit. The Type for the available connector does not match the Type ([Name]) for the Circuit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MismatchConnectorDistSysToCircuit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MismatchConnectorDistSysToCircuit As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MismatchConnectorDistSysToCircuit {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace